#include <iostream>
#include <iomanip>
#include <fstream>
#include <sstream>
#include <string>
#include <vector>
#include "Error.h"

using namespace std;

extern int lc;
extern vector<string> Errors;
extern fstream fileErr;

string err_msg[] = {
	/* 0*/ "源文件开始有非法单词",
	/* 1*/ "由于代码不全，以读至代码文件结束",
	/* 2*/ "无符号整数不能以0开始",
	/* 3*/ "+\\-号后丢失数值",
	/* 4*/ "不合法的字符常量",
	/* 5*/ "缺少右大括号",
	/* 6*/ "字符常量为空",
	/* 7*/ "缺少左大括号",
	/* 8*/ "const的声明需注明常量类型（已跳转至下一条合法常量声明）",
	/* 9*/ "缺少右大括号或分号",
	/*10*/ "缺少分号",
	/*11*/ "缺少逗号",
	/*12*/ "无法识别标识符是变量、数组还是带返回值函数",
	/*13*/ "缺少冒号",
	/*14*/ "函数的开始有非法单词",
	/*15*/ "缺少左中括号",
	/*16*/ "应该是一个数字",
	/*17*/ "缺少右中括号",
	/*18*/ "无法识别标识符是变量还是数组",
	/*19*/ "语句内不能进行常量、变量的定义",
	/*20*/ "应为标识符",
	/*21*/ "数组上界应为正整数",
	/*22*/ "无效字符",
	/*23*/ "缺少右小括号",
	/*24*/ "不等号书写错误（编译时已更正）",
	/*25*/ "void 关键词后应为标识符或main",//
	/*26*/ "语句的开始有非法单词",
	/*27*/ "常量非法赋值",//
	/*28*/ "应该是while",
	/*29*/ "缺少赋值符号",
	/*30*/ "常量只进行了声明没有赋值（缺少等号）",//
	/*31*/ "常量、变量和数组的声明应在函数声明之前（但仍视作该次声明有效）",//
	/*32*/ "缺少左小括号",
	/*33*/ "缺少双引号",
	/*34*/ "本编译器不支持for循环",
	/*35*/ "printf语句只能输出表达式和字符串",
	/*36*/ "非法的表达式",
	/*37*/ "非法的项",
	/*38*/ "void函数没有函数名",//
	/*39*/ "不能对标识符重新定义",
	/*40*/ "未定义的标识符",
	/*41*/ "缺少case关键字",
	/*42*/ "case后只能使用常量",
	/*43*/ "缺少冒号",
	/*44*/ "类型标识符只能是int或char",
	/*45*/ "无法识别该语句为赋值还是函数调用",
	/*46*/ "缺少单引号",
	/*47*/ "重复定义标识符",		//		语义错误
	/*48*/ "未定义的标识符",
	/*49*/ "数组索引类型应为INT",
	/*50*/ "赋值类型不匹配",
	/*51*/ "因子内的函数调用必须有返回值",
	/*52*/"void函数不应有返回值",
	/*53*/"scanf变量不能为函数",
	/*54*/"参数个数不匹配"
};

Error::Error() {		//construction func
	err = 0;
}

int Error::num() {
	return err;
}

bool Error::success() {
	return err == 0;
}

void Error::outputError(int n) {
	stringstream ss;
	err++;
	ss << "第" << setw(4) << lc << "行\t" << err_msg[n] << "\n";
	//DEBUG:
	//cout<< "第" << setw(4) << lc << "行\t" << err_msg[n] << endl;
	fileErr << ss.str();
	Errors.push_back(ss.str());				//push ss.str() on the tail of vector Errors
}